# Soru_06:
# 1
# 3, 5
# 7, 9, 11
# 13, 15, 17, 19
# .
# .
# .
#
# Yukarıdaki örüntünün 10. satırında bulunan 2. sayı kaçtır?

a = [1]

print(a)

for i in range(2,11):
	a = [a[-1] + 2]
	for y in range(i-1):
		a.append(a[-1]+2)
	print(a)

print("\n10. satırın 2. elemani:", a[1])

# ÇIKTI:
# [1]
# [3, 5]
# [7, 9, 11]
# [13, 15, 17, 19]
# [21, 23, 25, 27, 29]
# [31, 33, 35, 37, 39, 41]
# [43, 45, 47, 49, 51, 53, 55]
# [57, 59, 61, 63, 65, 67, 69, 71]
# [73, 75, 77, 79, 81, 83, 85, 87, 89]
# [91, 93, 95, 97, 99, 101, 103, 105, 107, 109]
#
# 10. satırın 2. elemani: 93
